{
    "temples": [{
        "location": "Raleigh North Carolina",
        "address": ["574 Bryan Drive", 
            "Apex, North Carolina 27502"],
        "telephone": "919-362-4135",
        "email": "N/A",
        "services": ["NO clothing rental available", 
            "NO cafeteria food served", 
            "NO patron housing available", 
            "NO distribution center nearby"],
        "history": ["The Raleigh North Carolina Temple's timely dedication was indeed a fitting offering to the Lord while the world observed His birth of nearly 2,000 years before. Moreover, the edifice was dedicated just five days before the 194th birthday anniversary of Joseph Smith, prophet of the Restoration. For North Carolina Latter-day Saints whose legacy extends back to the days when Jedediah M. Grant first preached the gospel there in 1838, the temple was a welcome gift, as well.",
            "For example, in attendance was Blanche Keith, 83, Garner Ward, a granddaughter of Durham Hall Smith, who became the first convert in Raleigh's county on September 15, 1895. Cecil Reese, the first stake president in North Carolina in 1961, spoke during the second dedicatory session. Brother Reese, 78, a retired Du Pont chemist originally from Logan, Utah, whose employment brought him to North Carolina, marveled at what a blessing it is to have a temple in relatively close proximity. \"I've sent people to the temple in either Arizona or Salt Lake who had sold everything they had except their cars to get the money to go,\" he recalled. \"They'd come back, and they wouldn't have a dime left. They'll never tell you it isn't the smartest investment they ever made.\"", 
            "Pamela Beavers and Deborah Byler of the Fayetteville 3rd Ward, emotionally embraced each other after the first dedicatory session. \"I will always remember this day and the feelings that I had,\" said Sister Beavers. \"The spirit is just enormous in this little temple.\" Sister Byler said that in 1989, she was one of the first sister missionaries to serve at the Arizona Temple Visitors Center. \"We had people come to the temple grounds so they could escape the outside world and feel the Spirit. And that same Spirit is here today.\"", 
            "School teacher Sarah Barnhill, a member of the Raleigh North Carolina Stake, was dismayed when she discovered that only a limited number of VIP guests could receive special invitations to the Raleigh North Carolina Temple open house and that her principal, who was also a minister, was not among them. So, Sister Barnhill obtained one of the 50,000 printed invitations available for distribution by members and personally extended the invitation. The small action sent ripples as her principal in turn took the invitation to his pulpit the next Sunday and urged the entire AME Rush Methodist congregation to see the newly completed temple for themselves. When she attended her principal's church services the Sunday after the open house as a gesture of courtesy, he brought her to the front of his congregation and thanked her for her personal invitation to experience such a beautiful building.", 
            "Apex Herald reporter David Leone prepared an eight-page Raleigh Temple commemorative insert for the Dec. 2 edition of the weekly newspaper. When 75 percent of that week's edition sold out two days after it hit the racks, the newspaper's circulation manager called to express regret that the paper had not fully appreciated the event the reporter pushed so hard to cover. He asked for the locations of other LDS temples being built in the South so he could alert other newspaper editors to what an asset an LDS temple can be.", 
            "Wake County Commissioner Yevonne Brannon was amazed at the images of the Savior during her tour of the temple. \"The artwork was simply stunning,\" she exclaimed. \"I felt myself drawn to each painting and found myself wanting to linger in front of every scene so I could contemplate the meaning of what was being portrayed. But how could I selfishly do that with so many people behind me?\"", 
            "At the confirmation of Gary Stansbury, construction superintendent for the temple, Bishop Bruce Nay of the Apex Ward commented, \"Most people come to the temple by way of the gospel; Gary came to the gospel by way of the temple.\" During construction, Brother Stansbury had begun investigating the Church and was baptized on September 29, 1999, after receiving the discussions by temple missionaries Elder Gaylen and Sister Alaire Johnson. \"Looking back at the series of events that brought me here to North Carolina, I don't much believe in coincidence,\" Brother Stansbury reflected. \"There are just too many things that fell into place, especially when I consider that the Johnsons were here, with whom I felt so at ease and who were so full of the Spirit.\"", 
            "Though he is from Kansas City, Missouri, right next to Independence, \"somehow the Church eluded me for 44 years,\" he said. Originally assigned to supervise a large retail project in St. Louis, Brother Stansbury was reassigned to the LDS temple in North Carolina due to a delay in St. Louis. The temple project was to be a temporary assignment, so he began to look for other work early on. However, by the time he received a substantial offer from an Atlanta company, he told them to call back in December. The building was completed in a record six months. \"I had to stay and build this temple,\" he said. \"I needed to be here. And thinking back now, it almost seems that I've kind of been led to learn for 44 years, and now, this [joining the Church] is what I'm supposed to do\" (Church News, 25 December 1999)."],
        "ordinance": ["Baptisms: 6:00PM - 7:30PM (Church Groups by Appointment Only, call to schedule)", 
            "Initiatory: 8:00AM - 8:15AM, 5:30PM - 5:45PM (Walk-ins Only)",
            "Initiatory: 8:30AM - 12:30PM, 6:00PM - 9:00PM (Appointments Only)",
            "Sealings: 8:45AM - 9:40AM, 10:15AM - 11:10AM, 11:45AM - 12:40PM, 6:15PM - 7:10PM, 8:00PM - 8:55PM (Appointments Only, call for own sealing)"],
        "session": "Endowments: 8:30AM, 10:00AM, 11:30AM, 6:00PM, 7:45PM (Appointment Only - English, Call for own endowment)",
        "closures": ["2019", 
            "Tuesday, 24 December 2019 - Thursday, 26 December 2019",
            "Tuesday, 31 December 2019",
            "2020",
            "Wednesday, 1 January 2020",
            "Saturday, 4 April 2020",
            "Monday, 18 May 2020 - Monday, 1 June 2020",
            "Saturday, 4 July 2020",
            "Saturday, 3 October 2020",
            "Monday, 16 November 2020 - Monday, 30 November 2020",
            "Thursday, 24 December 2020 - Saturday, 26 December 2020",
            "Thursday, 31 December 2020"],
        "photo": "raleighnctemple.jpg"
      },
      {
        "location": "Fort Lauderdale Florida",
        "address": ["3901 SW 154th Avenue", 
            "Davie, Florida 33331"],
        "telephone": "954-382-8390",
        "email": "N/A",
        "services": ["NO clothing rental available", 
            "NO cafeteria food served", 
            "NO patron housing available", 
            "NO distribution center nearby"],
        "history": ["The Fort Lauderdale Florida Temple is a temple of The Church of Jesus Christ of Latter-day Saints (LDS Church) near Fort Lauderdale, Florida. It is the 143rd temple of the LDS Church. The announcement that a temple would be built in south Florida was made by church president Thomas S. Monson on October 3, 2009, during the church's semi-annual general conference. The temple was announced concurrently with the Brigham City Utah, Concepción Chile, Fortaleza Brazil and Sapporo Japan temples. It is the second temple constructed in Florida and the first in the heavily populated southern part of the state. The state's other temple, in Orlando, was completed in 1994.", 
            "Subsequent to the announcement, a local church official indicated that the temple would likely be constructed somewhere in western Broward County rather than within the city of Fort Lauderdale itself. No specific location was disclosed.", 
            "Ground was broken on June 18, 2011. A public open house took place from March 29 to April 19, 2014. The temple was formally dedicated on May 4, 2014, by Dieter F. Uchtdorf of the church's First Presidency. The temple is designed to serve an estimated 25,000 church members in South Florida.", 
            "The temple was given a 2014 South-East Engineering Award for best built building. (Wikipedia)"],
        "ordinance": ["Baptisms: 6:00PM - 8:00PM (Appointments and Walk-ins, Church Groups by Appointment Only call to schedule)", 
            "Initiatory: 6:00PM - 8:30PM (Appointments and Walk-ins)",
            "Sealings: 6:00PM - 8:00PM (Appointments and Walk-ins, call for own sealing)"],
        "session": "Endowments: 6:15PM, 7:30PM (Appointments and Walk-ins - English, Call for own endowment)",
        "closures": ["2019", 
            "Tuesday, 24 December 2019 - Wednesday, 25 December 2019",
            "Tuesday, 31 December 2019",
            "2020",
            "Wednesday, 1 January 2020",
            "Saturday, 4 April 2020",
            "Monday, 27 April 2020 - Monday, 11 May 2020",
            "Saturday, 4 July 2020",
            "Saturday, 3 October 2020",
            "Monday, 26 October 2020 - Monday, 9 November 2020",
            "Wednesday, 25 November 2020 - Thursday, 26 November 2020",
            "Thursday, 24 December 2020 - Friday, 25 December 2020",
            "Thursday, 31 December 2020"],
        "photo": "fortlauderdalefltemple4.jpg"
      },
      {
        "location": "Philadelphia Pennsylvania",
        "address": ["1739 Vine Street", 
            "Philadelphia, Pennsylvania 19103"],
        "telephone": "215-398-3040",
        "email": "N/A",
        "services": ["Clothing rental available", 
            "NO cafeteria food served", 
            "NO patron housing available", 
            "NO distribution center nearby"],
        "history": ["Following the October 2008 announcement of plans to build a temple in Philadelphia, on November 19, 2009, the LDS Church announced it would be on Vine Street in downtown Philadelphia, directly northeast of Logan Circle. This location places the temple near the Parkway Central Library, Family Court Building, and the Cathedral Basilica of Saints Peter and Paul, head church of the Roman Catholic Archdiocese of Philadelphia.", 
            "Ground was broken for the temple on September 17, 2011. Local community leaders were present for the ceremonies which were presided over by Henry B. Eyring, First Counselor in the church's First Presidency. By July 2012, no significant work had begun on the temple as a contractor had not been found to remove the existing parking lot and start the below ground excavation for the two-level parking garage. In November 2012, the Philadelphia Art Commission granted final approval for the temple design, despite some members feeling the building was too similar to other buildings in the vicinity in its appearance. Most of the parking lot on the temple site had been removed by February 2013, and by May 2 that year, the underground digging for the building of the temple had been completed. The building was framed to its full height by August 2014. (Wikipedia)"],
        "ordinance": ["Baptisms: 6:00PM - 9:00PM (Appointment Only, call to schedule)", 
            "Initiatory: 5:45PM - 9:00PM (Walk-ins Only)",
            "Sealings: 5:30PM - 9:00PM (Walk-ins Only, call for own sealing)"],
        "session": "Endowments: 6:30PM, 7:45PM (Walk-ins Only - English, Call for own endowment)",
        "closures": ["2019", 
            "Tuesday, 24 December 2019 - Wednesday, 25 December 2019",
            "Tuesday, 31 December 2019",
            "2020",
            "Wednesday, 1 January 2020",
            "Tuesday, 24 March 2020 - Monday, 6 April 2020",
            "Tuesday, 7 April 2020 - Thursday, 9 April 2020 (Limited Hours)",
            "Saturday, 4 July 2020",
            "Tuesday, 22 September 2020 - Monday, 5 October 2020",
            "Tuesday, 6 October 2020 - Saturday, 10 October 2020 (Limited Hours)",
            "Wednesday, 25 November 2020 - Thursday, 26 November 2020",
            "Thursday, 24 December 2020 - Friday, 25 December 2020",
            "Thursday, 31 December 2020"],
        "photo": "philadelphiatemple5.jpg"
      },
      {
        "location": "Hartford Connecticut",
        "address": ["2 Central Way", 
            "Farmington, Connecticut 06032"],
        "telephone": "860-773-7200",
        "email": "N/A",
        "services": ["NO clothing rental available", 
            "NO cafeteria food served", 
            "NO patron housing available", 
            "Distribution center nearby"],
        "history": ["During the Saturday afternoon session of General Conference on October 3, 1992, President Gordon B. Hinckley, First Counselor in the First Presidency, announced plans for a regional temple to be built in Hartford, Connecticut, to serve members in the New York and New England areas of the United States. Plans were also announced for a temple in Hong Kong to serve a large region of Southeastern Asia and for a second temple in Utah County to relieve the overburdened Provo Utah Temple—later identified as the Mount Timpanogos Utah Temple.", 
            "Three years after the announcement, plans for the Hartford Connecticut Temple were replaced. President Gordon B. Hinckley explained in the priesthood session of General Conference, \"After working for years to acquire a suitable site in the Hartford area, during which time the Church has grown appreciably in areas to the north and south, we have determined that we will not at this time build a temple in the immediate area of Hartford.\" Plans were then announced for temples in Boston, Massachusetts, and White Plains, New York. \"In other words,\" he said, \"there will be two [temples] to serve the needs of the people where originally it was planned that one would do. We have sites in both of these new locations.\"", 
            "To the members of Hartford who had joyed in the announcement of this temple, Pres. Hinckley said, \"We apologize to our faithful Saints in the Hartford area. We know you will be disappointed in this announcement. You know that we, and your local officers, have spent countless hours searching for a suitable location that would handle the needs of the Saints in New York and New England. While we deeply regret disappointing the people in the Hartford area, we are satisfied that we have been led to the present decision, and that temples will be located in such areas that our Saints in the Hartford area will not have to drive unreasonable distances.\""],
        "ordinance": ["Baptisms: 6:00PM - 8:00PM (Appointments Only, call to schedule)", 
            "Initiatory: 6:00PM - 9:00PM (Appointments and Walk-ins)",
            "Sealings: 6:00PM - 9:00PM (Appointments and Walk-ins, call for own sealing)"],
        "session": "Endowments: 6:00PM, 7:45PM (Appointments and Walk-ins, Call for own endowment)",
        "closures": ["2019", 
            "Tuesday, 24 December 2019 - Wednesday, 25 December 2019",
            "Tuesday, 31 December 2019",
            "2020",
            "Wednesday, 1 January 2020",
            "Saturday, 4 April 2020",
            "Monday, 18 May 2020 - Monday, 1 June 2020",
            "Saturday, 4 July 2020",
            "Saturday, 3 October 2020",
            "Monday, 9 November 2020 - Monday, 23 November 2020",
            "Wednesday, 25 November 2020 - Thursday, 26 November 2020",
            "Thursday, 24 December 2020 - Friday, 25 December 2020",
            "Thursday, 31 December 2020 - Friday, 1 January 2021"],
        "photo": "hartfordcttemple.jpg"
      }
    ]
  }